namespace Yutai.ArcGIS.Catalog.VCT
{
    public enum CoTopologyRuleType
    {
        esriTRTAny = -1,
        esriTRTFeatureLargerThanClusterTolerance = 0,
        点必须被面边界覆盖 = 13,
        点必须被线端点覆盖 = 0x1f,
        点必须被线覆盖 = 0x1d,
        点必须位于面内部 = 15,
        面层必须被另一个面层覆盖 = 4,
        面层必须与另一个面层彼此覆盖 = 5,
        面层边界必须被另一个面层边界覆盖 = 0x26,
        面层边界必须被线层覆盖 = 0x25,
        面层内要素被另一个面层要素覆盖 = 7,
        面层内要素间相互重叠 = 3,
        面层内要素间有缝隙 = 1,
        面层内要素至少包含一个点 = 0x2b,
        面层要素和另一面层要素重叠 = 8,
        线层必须被面层边界覆盖 = 10,
        线层内要素必须为单部分 = 0x2c,
        线层内要素端点必须被点层覆盖 = 0x2a,
        线层内要素互相相交 = 20,
        线层内要素间互相重叠 = 0x13,
        线层内要素相交或内部相交 = 0x29,
        线层内要素有悬挂节点 = 0x15,
        线层要素必须被另一线层要素覆盖 = 0x1a,
        线层与线层间要素相互重叠 = 0x1c,
        线有伪节点 = 0x16,
        线自相交 = 40,
        线自重叠 = 0x27
    }
}

