namespace Yutai.ArcGIS.Catalog.VCT
{
    public enum CoTopologyRuleType
    {
        esriTRTAny = -1,
        esriTRTFeatureLargerThanClusterTolerance = 0,
        点必须被面边界覆盖 = 13,
        点必须被线端点覆盖 = 31,
        点必须被线覆盖 = 29,
        点必须位于面内部 = 15,
        面层必须被另一个面层覆盖 = 4,
        面层必须与另一个面层彼此覆盖 = 5,
        面层边界必须被另一个面层边界覆盖 = 38,
        面层边界必须被线层覆盖 = 37,
        面层内要素被另一个面层要素覆盖 = 7,
        面层内要素间相互重叠 = 3,
        面层内要素间有缝隙 = 1,
        面层内要素至少包含一个点 = 43,
        面层要素和另一面层要素重叠 = 8,
        线层必须被面层边界覆盖 = 10,
        线层内要素必须为单部分 = 44,
        线层内要素端点必须被点层覆盖 = 42,
        线层内要素互相相交 = 20,
        线层内要素间互相重叠 = 19,
        线层内要素相交或内部相交 = 41,
        线层内要素有悬挂节点 = 21,
        线层要素必须被另一线层要素覆盖 = 26,
        线层与线层间要素相互重叠 = 28,
        线有伪节点 = 22,
        线自相交 = 40,
        线自重叠 = 39
    }
}

